import math


def area(r):
    '''
    Возвращает площадь окружности
    Параметры
        r (float): радиус окружности
    Возвращаемое значение
        Pi*r^2 (float): площадь окружности с радиусом r
    Пример вызова:
        print(circle.area(3.0)) выведет площадь окружности с радиусом 3
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает длину окружности
    Параметры
        r (float): радиус окружности
    Возвращаемое значение
        Pi*r*2 (float): длина окружности с радиусом r
    Пример вызова:
        print(circle.perimeter(3.0)) выведет длину окружности с радиусом 3
    '''
    return 2 * math.pi * r

