def area(a, b):
    '''
    Возвращает плошадь прямоугольника
    Параметры
        a (float): длина стороны прямоугольника
        a (float): длина другой стороны прямоугольника
    Возвращаемое значение
        a*b (float): площадь прямоугольника с сторонами a и b
    Пример вызова:
        print(rectangle.area(3.0,2.0)) выведет площадь прямоугольника со сторонами 2 и 3
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника
    Параметры
        a (float): длина стороны прямоугольника
        a (float): длина другой стороны прямоугольника
    Возвращаемое значение
        2*(a+b) (float): периметр прямоугольника с сторонами a и b
    Пример вызова:
        print(rectangle.perimeter(3.0,2.0)) выведет периметр прямоугольника со сторонами 2 и 3
    '''
    return 2*(a + b)
