
def area(a):
    '''
    Возвращает площадь квадрата
    Параметры
        a (float): длина стороны квадрата
    Возвращаемое значение
        a*a (float): площадь квадрата со стороной a
    Пример вызова:
        print(square.area(3.0)) выведет площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата
    Параметры
        a (float): длина стороны квадрата
    Возвращаемое значение
        a*4 (float): периметр квадрата со стороной a
    Пример вызова:
        print(square.perimeter(3.0)) выведет периметр квадрата со стороной a
    '''
    return 4 * a
