def area(a, h): 
    '''
    Возвращает площадь треугольника
    Параметры
        a (float): основание треугольника
        h (float): высота треугольника
    Возвращаемое значение
        a*h/2 (float): площадь трегольника с основанием a и высотой h
    Пример вызова:
        print(triangle.area(2.3,8.0)) выведет площадь треугольника с основанием 2.3 и высотой 8
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника
    Параметры
        a,b,c (float): стороны треугольника
    Возвращаемое значение
        a+b+c (float): периметр треугольника со сторонами a, b и c
    Пример вызова:
        print(triangle.perimeter(2.0,3.0,8.0)) выведет периметр треугольника со сторонами 2, 3 и 8
    '''
    return a + b + c 
